{"backend": "tensorflow", "config": {"name": "sequential_4", "layers": [{"config": {"bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_19", "activation": "relu", "kernel_constraint": null, "batch_input_shape": [null, 16], "kernel_regularizer": null, "units": 1024, "dtype": "float32", "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_16", "seed": null, "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_20", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "units": 128, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_17", "seed": null, "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_21", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "units": 512, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_18", "seed": null, "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_22", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "units": 64, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_19", "seed": null, "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_23", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "units": 128, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_20", "seed": null, "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_24", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "units": 64, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_21", "seed": null, "noise_shape": null, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_25", "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "units": 8, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Sequential"}